<template>
  <header>
    <div class="imgz">
      <div id="carouselExampleControls" class="carousel slide" data-bs-ride="carousel">
        <div class="carousel-inner">
          <div class="carousel-item active">
            <img src="pic/01.jpg" class="d-block w-100" alt="..." />
          </div>
          <div class="carousel-item">
            <img src="pic/03.jpg" class="d-block w-100" alt="..." />
          </div>
        </div>
        <button
          class="carousel-control-prev"
          type="button"
          data-bs-target="#carouselExampleControls"
          data-bs-slide="prev"
        >
          <span class="carousel-control-prev-icon" aria-hidden="true"></span>
          <span class="visually-hidden">Previous</span>
        </button>
        <button
          class="carousel-control-next"
          type="button"
          data-bs-target="#carouselExampleControls"
          data-bs-slide="next"
        >
          <span class="carousel-control-next-icon" aria-hidden="true"></span>
          <span class="visually-hidden">Next</span>
        </button>
      </div>
    </div>
  </header>
  <div class="teamcard">
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new1.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">
            นักศึกษาที่ลงทะเบียนในภาคเรียนที่ 1/2565 รายวิชาใดได้เกรด I หรือเกรดว่าง
            ให้ติดต่ออาจารย์ประจำวิชา เพื่อดำเนินการแก้ไขเกรด
            ให้ติดตามผลการแก้เกรดของตนเองที่ผลการเรียน เกรดต้องแสดงในผลการเรียนภายในวันที่
            21 ธันวาคม 2565 หากไม่ดำเนินการภายในระยะเวลาที่กำหนด
            รายวิชาดังกล่าวจะถูกปรับเป็น F หรือ U
          </p>
        </div>
      </div>
    </div>
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new2.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">
            📌น้องๆ ที่เรียนหลักสูตร 4 ปี และ 5 ปี (ม.6/ปวช.)📌 ✨ผ่านการคัดเลือกแล้ว🥳
            ✒️ให้ลงทะเบียนใช้งานระบบเพื่อใช้ในการ #ยืนยันสิทธิ์✨ ที่
            <a href="https://www.mytcas.com/">https://www.mytcas.com/</a> ก่อนวันที่ 7
            ก.พ.66 นะคะ 💖
          </p>
        </div>
      </div>
    </div>
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new3.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">
            ขอเชิญรับฟังการประชันนโยบายและปราศัยหาเสียง
            ของผู้สมัครรับเลือกตั้งนายกองค์การนักศึกษา มหาวิทยาลัยแม่โจ้ ประจำปี 2566
            ในวันพุธที่ 1 กุมภาพันธ์ 2566 เวลา 18.00 น. เป็นต้นไป ณ เวทีดิน
            ข้างโรงอาหารเทอดกสิกร มหาิวทยาลัยแม่โจ้ - ชมการแสดงวงดนตรี Maejo Banjo Man -
            การปราศัยหาเสียงของผู้สมัครนายก อนม. -
            การแนะนำตัวผู้สมัครนายกสโมสรนักศึกษาคณะ/วิทยาลัย -
            การแนะนำผู้สมครสมาชิกสภานักศึกษา
          </p>
        </div>
      </div>
    </div>
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new4.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">
            นศ. ที่จะต้องใช้ผลการเรียนในเว็บงานทะเบียน (reg.mju.ac.th) ‼️ ‼️
            เพื่อแนบสำหรับการดำเนินการใดๆ เช่น ยื่นขอทุน ฯลฯ 🖨
            ให้เข้าไปพิมพ์ผลการเรียนภายในวันอาทิตย์ 29 ม.ค. 2566 เท่านั้น 📅
            หลังจากนั้นจะเปิดระบบประเมินการเรียนการสอนของเทอม 2/65
            ซึ่งจะทำให้นักศึกษาไม่สามารถเข้าดูผลการเรียนได้
            จนกว่าจะทำการประเมินการเรียนการสอนของเทอม 2/65 เสร็จสิ้น
          </p>
        </div>
      </div>
    </div>
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new5.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">
            ประชาสัมพันธ์ การประชุมสัมมนา เรื่อง
            ประกาศคณะกรรมการมาตรฐานการอุดมศึกษาที่เกี่ยวข้องกับมาตรฐานการอุดมศึกษา 6 ฉบับ
            (ผ่านสื่ออิเล็กทรอนิกส์)
          </p>
        </div>
      </div>
    </div>
    <div class="card-item">
      <div class="card" style="width: 18rem">
        <img src="pic/new6.jpg" class="card-img-top" alt="..." />
        <div class="card-body">
          <p class="card-text">แจ้งตารางเรียนวิชา ศท141, ศท142, ศท241</p>
        </div>
      </div>
    </div>
  </div>
</template>

<style scoped>
img {
  display: flex;
  height: 500px;
  height: 100%;
}

.teamcard {
  display: grid;
  justify-content: center;
  align-items: center;
  grid-template-columns: 1fr 1fr 1fr;
  background-color: rgb(235, 235, 244);
}
.card-item {
  padding: 15px;
}
</style>
